{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "LSTM", "config": {"activation": "tanh", "units": 4, "recurrent_dropout": 0.0, "return_state": false, "recurrent_activation": "hard_sigmoid", "kernel_regularizer": null, "use_bias": true, "name": "lstm_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_regularizer": null, "bias_regularizer": null, "go_backwards": false, "trainable": true, "implementation": 1, "unroll": false, "dropout": 0.0, "unit_forget_bias": true, "recurrent_constraint": null, "bias_constraint": null, "return_sequences": false, "kernel_constraint": null, "stateful": false, "activity_regularizer": null, "batch_input_shape": [null, null, 1], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "dtype": "float32"}}, {"class_name": "Dense", "config": {"activation": "selu", "units": 1, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_10", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "elu", "units": 1, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_11", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "elu", "units": 1, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_12", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "linear", "units": 1, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_13", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"activation": "hard_sigmoid", "units": 1, "trainable": true, "kernel_regularizer": null, "use_bias": true, "name": "dense_14", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}]}