{"config": [{"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "unroll": false, "name": "lstm_8", "return_state": false, "kernel_regularizer": null, "use_bias": true, "return_sequences": false, "bias_constraint": null, "stateful": false, "units": 4, "recurrent_dropout": 0.0, "activation": "tanh", "unit_forget_bias": true, "trainable": true, "implementation": 1, "batch_input_shape": [null, null, 1], "dropout": 0.0, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 1, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "dense_8", "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}