{"config": [{"config": {"activation": "tanh", "bias_constraint": null, "stateful": false, "kernel_regularizer": null, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "implementation": 1, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "batch_input_shape": [null, null, 1], "kernel_constraint": null, "return_sequences": false, "unit_forget_bias": true, "dropout": 0.0, "dtype": "float32", "recurrent_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "lstm_1", "recurrent_constraint": null, "units": 4, "go_backwards": false, "unroll": false, "bias_regularizer": null, "recurrent_dropout": 0.0, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "units": 1, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "units": 1, "bias_constraint": null, "activation": "softsign", "kernel_regularizer": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}