{"keras_version": "2.1.6", "config": [{"config": {"return_state": false, "kernel_constraint": null, "dtype": "float32", "name": "lstm_5", "batch_input_shape": [null, null, 1], "units": 4, "unroll": false, "kernel_regularizer": null, "activation": "tanh", "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "trainable": true, "bias_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "use_bias": true, "stateful": false, "unit_forget_bias": true, "dropout": 0.0, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_activation": "hard_sigmoid", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "return_sequences": false, "bias_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "implementation": 1}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_15", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_16", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_17", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "hard_sigmoid", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_18", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "hard_sigmoid", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_19", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "relu", "use_bias": true}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "kernel_constraint": null, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_20", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "kernel_regularizer": null, "activity_regularizer": null, "activation": "softmax", "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}