{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_regularizer": null, "name": "lstm_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dropout": 0.0, "trainable": true, "recurrent_regularizer": null, "activity_regularizer": null, "return_state": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "batch_input_shape": [null, null, 1], "kernel_constraint": null, "return_sequences": false, "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "use_bias": true, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "implementation": 1, "go_backwards": false, "activation": "tanh", "unroll": false, "bias_constraint": null, "stateful": false}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_15", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "activation": "linear", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "activation": "tanh", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "activation": "selu", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "name": "dense_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_regularizer": null, "use_bias": true, "units": 1, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "kernel_constraint": null}}]}